import pandas as pd

df=pd.read_excel('StationsHavashenasi.xlsx')
# stations=set(df['code'].tolist())
# # print(stations)
# print(len(stations))

# BARESH STATIONS
df1=pd.read_excel('هواشناسی_بارش_روزانه_حوضه ای_11.xlsx')
# print(df)
aras11stations_BARESH=set(df1['code'].tolist())
print('11-Aras BARESH stations:',aras11stations_BARESH)
print(len(aras11stations_BARESH))
# 11-Aras  stations: {'19-945', '19-121', '19-051', '19-084', '19-044', '19-965', '19-025', '19-049', '19-940', '19-064', '19-058', '19-023', '19-088', '19-037', '19-069', '19-026', '19-059', '19-068', '19-062', '19-046', '19-033', '19-114', '19-401', '19-921', '19-053', '19-070', '19-039', '19-925', '19-052', '19-124', '19-985', '19-944', '19-957', '19-076', '19-105', '19-127', '19-101', '19-099', '19-015', '19-116', '19-018', '19-111', '19-056', '19-807', '19-075', '19-095', '19-020', '19-123', '19-073', '19-097', '19-937', '19-931', '19-091', '19-914', '19-872', '19-175', '19-963', '19-873', '19-115', '19-131', '19-040', '19-149', '19-967', '19-969', '19-946', '19-125', '19-100', '19-078', '19-932', '19-082', '19-096', '19-888', '19-936', '19-955', '19-854', '19-050', '19-181', '19-195', '19-112', '19-954', '19-885', '19-147', '19-968', '19-139', '19-077', '19-089', '19-085', '19-952', '19-143', '19-135', '19-072', '19-024', '19-865', '19-067', '19-092', '19-041', '19-019', '19-042', '19-081', '19-943', '19-935', '19-933', '19-942', '19-098', '19-173', '19-950', '19-910', '19-071', '19-941', '19-029', '19-144', '19-867', '19-063', '19-883', '19-947', '19-953', '19-215', '19-055', '19-003', '19-093', '19-891', '19-146', '19-948', '19-102', '19-066', '19-031', '19-128', '19-938', '19-104', '19-087', '19-027', '19-958', '19-875', '19-196', '19-057', '19-094', '19-171', '19-949', '19-021', '19-975', '19-110', '19-168', '19-142', '19-187', '19-011', '19-083', '19-054', '19-930', '19-090', '19-086', '19-013', '19-922', '19-141', '19-034', '19-080', '19-060', '19-045', '19-927', '19-956', '19-007', '19-065', '19-939', '19-074', '19-929', '19-047', '19-934', '19-951', '19-169', '19-035', '19-177', '19-010', '19-001', '19-924'}
# print(set(aras11stations).issubset(set(stations)))

# headers=['code','ertefa','arz','tool']
# df_coordinates=pd.DataFrame(columns=headers)
# for station in aras11stations_BARESH:
#     if station = df[df['code']==station].values:
# print(df[df['code']=='11-002']['arz'].values)

df1_Bareshstation=df.loc[(df['code'].isin(aras11stations_BARESH))]
df_coordinates=df1_Bareshstation[['code','station','ertefa','arz','tool','tasis']]
df_coordinates.to_excel('11Aras_stations_coordinates1.xlsx')
##############################################
# TABKHIR STATIONS
df2=pd.read_excel('هواشناسی_تبخیر_روزانه_حوضه ای_11.xlsx')
# print(df)
aras11stations_EVAPO=set(df2['code'].tolist())
print('11-Aras  stations:',aras11stations_EVAPO)
print(len(aras11stations_EVAPO))
# print(set(aras11stations_EVAPO).issubset(set(aras11stations_BARESH)))
print(set(aras11stations_BARESH).intersection(set(aras11stations_EVAPO)))